In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

Coronavirus Data Clean-Up

In [2]:
corona_file = "Resources/2019_nCoV_data.csv"
corona_data_df = pd.read_csv(corona_file)
corona_data_df.head()

,Sno,Date,Province/State,Country,Last Update,Confirmed,Deaths,Recovered
0,1,01/22/2020 12:00:00,Anhui,China,01/22/2020 12:00:00,1.0,0.0,0.0
1,2,01/22/2020 12:00:00,Beijing,China,01/22/2020 12:00:00,14.0,0.0,0.0
2,3,01/22/2020 12:00:00,Chongqing,China,01/22/2020 12:00:00,6.0,0.0,0.0
3,4,01/22/2020 12:00:00,Fujian,China,01/22/2020 12:00:00,1.0,0.0,0.0
4,5,01/22/2020 12:00:00,Gansu,China,01/22/2020 12:00:00,0.0,0.0,0.0

In [3]:
new_corona_data_df = corona_data_df[['Country', 'Confirmed', 'Deaths']].copy()
new_corona_data_df.head()

  Country  Confirmed  Deaths
0   China        1.0     0.0
1   China       14.0     0.0
2   China        6.0     0.0
3   China        1.0     0.0
4   China        0.0     0.0

In [4]:
grouped_corona_data_df = new_corona_data_df.replace({'Mainland China': 'China'}).groupby(['Country'], 
                                                                                         as_index=False).sum()
grouped_corona_data_df

                 Country  Confirmed   Deaths
0              Australia      284.0      0.0
1                Belgium       14.0      0.0
2                 Brazil        0.0      0.0
3               Cambodia       22.0      0.0
4                 Canada      116.0      0.0
5                  China   773500.0  17908.0
6                  Egypt        4.0      0.0
7                Finland       20.0      0.0
8                 France      186.0      3.0
9                Germany      252.0      0.0
10             Hong Kong      681.0     14.0
11                 India       50.0      0.0
12                 Italy       49.0      0.0
13           Ivory Coast        0.0      0.0
14                 Japan      591.0      5.0
15                 Macau      209.0      0.0
16              Malaysia      303.0      0.0
17                Mexico        0.0      0.0
18                 Nepal       24.0      0.0
19                Others     2161.0      0.0
20           Philippines       47.0     17.0
21                Russia       36.0      0.0
22             Singapore      797.0      0.0
23           South Korea      444.0      0.0
24                 Spain       27.0      0.0
25             Sri Lanka       22.0      0.0
26                Sweden       18.0      0.0
27                Taiwan      320.0      2.0
28              Thailand      581.0      0.0
29                    UK       93.0      0.0
30                    US      250.0      0.0
31  United Arab Emirates      126.0      0.0
32               Vietnam      225.0      0.0

In [5]:
updated_corona_data_df = grouped_corona_data_df.rename(columns = {'Confirmed':'Cases'})
updated_corona_data_df

                 Country     Cases   Deaths
0              Australia     284.0      0.0
1                Belgium      14.0      0.0
2                 Brazil       0.0      0.0
3               Cambodia      22.0      0.0
4                 Canada     116.0      0.0
5                  China  773500.0  17908.0
6                  Egypt       4.0      0.0
7                Finland      20.0      0.0
8                 France     186.0      3.0
9                Germany     252.0      0.0
10             Hong Kong     681.0     14.0
11                 India      50.0      0.0
12                 Italy      49.0      0.0
13           Ivory Coast       0.0      0.0
14                 Japan     591.0      5.0
15                 Macau     209.0      0.0
16              Malaysia     303.0      0.0
17                Mexico       0.0      0.0
18                 Nepal      24.0      0.0
19                Others    2161.0      0.0
20           Philippines      47.0     17.0
21                Russia      36.0      0.0
22             Singapore     797.0      0.0
23           South Korea     444.0      0.0
24                 Spain      27.0      0.0
25             Sri Lanka      22.0      0.0
26                Sweden      18.0      0.0
27                Taiwan     320.0      2.0
28              Thailand     581.0      0.0
29                    UK      93.0      0.0
30                    US     250.0      0.0
31  United Arab Emirates     126.0      0.0
32               Vietnam     225.0      0.0

In [6]:
sorted_corona_df = updated_corona_data_df.sort_values(by=['Country'], ascending=True)
sorted_corona_df

                 Country     Cases   Deaths
0              Australia     284.0      0.0
1                Belgium      14.0      0.0
2                 Brazil       0.0      0.0
3               Cambodia      22.0      0.0
4                 Canada     116.0      0.0
5                  China  773500.0  17908.0
6                  Egypt       4.0      0.0
7                Finland      20.0      0.0
8                 France     186.0      3.0
9                Germany     252.0      0.0
10             Hong Kong     681.0     14.0
11                 India      50.0      0.0
12                 Italy      49.0      0.0
13           Ivory Coast       0.0      0.0
14                 Japan     591.0      5.0
15                 Macau     209.0      0.0
16              Malaysia     303.0      0.0
17                Mexico       0.0      0.0
18                 Nepal      24.0      0.0
19                Others    2161.0      0.0
20           Philippines      47.0     17.0
21                Russia      36.0      0.0
22             Singapore     797.0      0.0
23           South Korea     444.0      0.0
24                 Spain      27.0      0.0
25             Sri Lanka      22.0      0.0
26                Sweden      18.0      0.0
27                Taiwan     320.0      2.0
28              Thailand     581.0      0.0
29                    UK      93.0      0.0
30                    US     250.0      0.0
31  United Arab Emirates     126.0      0.0
32               Vietnam     225.0      0.0

In [7]:
sorted_corona_df.dtypes

Country     object
Cases      float64
Deaths     float64
dtype: object

In [8]:
sorted_corona_df['ID'] = sorted_corona_df.index
sorted_corona_df

                 Country     Cases   Deaths  ID
0              Australia     284.0      0.0   0
1                Belgium      14.0      0.0   1
2                 Brazil       0.0      0.0   2
3               Cambodia      22.0      0.0   3
4                 Canada     116.0      0.0   4
5                  China  773500.0  17908.0   5
6                  Egypt       4.0      0.0   6
7                Finland      20.0      0.0   7
8                 France     186.0      3.0   8
9                Germany     252.0      0.0   9
10             Hong Kong     681.0     14.0  10
11                 India      50.0      0.0  11
12                 Italy      49.0      0.0  12
13           Ivory Coast       0.0      0.0  13
14                 Japan     591.0      5.0  14
15                 Macau     209.0      0.0  15
16              Malaysia     303.0      0.0  16
17                Mexico       0.0      0.0  17
18                 Nepal      24.0      0.0  18
19                Others    2161.0      0.0  19
20           Philippines      47.0     17.0  20
21                Russia      36.0      0.0  21
22             Singapore     797.0      0.0  22
23           South Korea     444.0      0.0  23
24                 Spain      27.0      0.0  24
25             Sri Lanka      22.0      0.0  25
26                Sweden      18.0      0.0  26
27                Taiwan     320.0      2.0  27
28              Thailand     581.0      0.0  28
29                    UK      93.0      0.0  29
30                    US     250.0      0.0  30
31  United Arab Emirates     126.0      0.0  31
32               Vietnam     225.0      0.0  32

In [9]:
sorted_corona_df['Cases'] = sorted_corona_df['Cases'].astype(np.int64)
sorted_corona_df

                 Country   Cases   Deaths  ID
0              Australia     284      0.0   0
1                Belgium      14      0.0   1
2                 Brazil       0      0.0   2
3               Cambodia      22      0.0   3
4                 Canada     116      0.0   4
5                  China  773500  17908.0   5
6                  Egypt       4      0.0   6
7                Finland      20      0.0   7
8                 France     186      3.0   8
9                Germany     252      0.0   9
10             Hong Kong     681     14.0  10
11                 India      50      0.0  11
12                 Italy      49      0.0  12
13           Ivory Coast       0      0.0  13
14                 Japan     591      5.0  14
15                 Macau     209      0.0  15
16              Malaysia     303      0.0  16
17                Mexico       0      0.0  17
18                 Nepal      24      0.0  18
19                Others    2161      0.0  19
20           Philippines      47     17.0  20
21                Russia      36      0.0  21
22             Singapore     797      0.0  22
23           South Korea     444      0.0  23
24                 Spain      27      0.0  24
25             Sri Lanka      22      0.0  25
26                Sweden      18      0.0  26
27                Taiwan     320      2.0  27
28              Thailand     581      0.0  28
29                    UK      93      0.0  29
30                    US     250      0.0  30
31  United Arab Emirates     126      0.0  31
32               Vietnam     225      0.0  32

In [10]:
rds_connection_string = "postgres:postgres@localhost:5432/etl_project"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [27]:
engine.table_names()

['corona_virus_table', 'swineFlu', 'corona_virus', 'swine_flu']

In [12]:
sorted_corona_df.to_sql(name='corona_virus', con=engine, if_exists='replace', index=False)

In [13]:
pd.read_sql_query('select * from corona_virus', con=engine).head()

     Country  Cases  Deaths  ID
0  Australia    284     0.0   0
1    Belgium     14     0.0   1
2     Brazil      0     0.0   2
3   Cambodia     22     0.0   3
4     Canada    116     0.0   4

H1N1 Data Clean-Up

In [14]:
swine_file = "Resources/Pandemic_(H1N1)_2009.csv"
swine_data_df = pd.read_csv(swine_file, encoding='ISO-8859-1')
swine_data_df.head()

               Country  Cases  Deaths    Update Time
0              Algeria      5     0.0  7/6/2009 9:00
1  Antigua and Barbuda      2     0.0  7/6/2009 9:00
2            Argentina   2485    60.0  7/6/2009 9:00
3            Australia   5298    10.0  7/6/2009 9:00
4              Austria     19     0.0  7/6/2009 9:00

In [15]:
latestDate = "7/6/2009 9:00"

In [16]:
swine_data_df.sort_values(by="Country", ascending=True)

                     Country  Cases  Deaths     Update Time
0                    Algeria      5     0.0   7/6/2009 9:00
383                  Algeria      2     0.0  6/29/2009 9:00
721                  Algeria      1     0.0  6/22/2009 7:00
262                  Algeria      2     0.0   7/1/2009 9:00
612                  Algeria      2     0.0  6/24/2009 7:00
..                       ...    ...     ...             ...
82   Netherlands, Aruba      5     0.0   7/6/2009 9:00
45   New Caledonia, FOC     12     0.0   7/6/2009 9:00
127         Puerto Rico     18     0.0   7/6/2009 9:00
46    Saint Martin, FOC      1     0.0   7/6/2009 9:00
128      Virgin Islands      1     0.0   7/6/2009 9:00

[1822 rows x 4 columns]

In [17]:
swine_data_dfClean = swine_data_df.loc[swine_data_df['Update Time'] == latestDate]
swine_data_dfClean

                      Country  Cases  Deaths    Update Time
0                     Algeria      5     0.0  7/6/2009 9:00
1         Antigua and Barbuda      2     0.0  7/6/2009 9:00
2                   Argentina   2485    60.0  7/6/2009 9:00
3                   Australia   5298    10.0  7/6/2009 9:00
4                     Austria     19     0.0  7/6/2009 9:00
..                        ...    ...     ...            ...
131                 Venezuela    206     0.0  7/6/2009 9:00
132                  Viet Nam    181     0.0  7/6/2009 9:00
133  West Bank and Gaza Strip     60     0.0  7/6/2009 9:00
134                     Yemen      8     0.0  7/6/2009 9:00
135               Grand Total  94512   429.0  7/6/2009 9:00

[136 rows x 4 columns]

In [18]:
swine_data_dfSum = swine_data_dfClean.groupby("Country", as_index=False)['Cases','Deaths'].sum()
swine_data_dfSum.head()

               Country  Cases  Deaths
0              Algeria      5     0.0
1  Antigua and Barbuda      2     0.0
2            Argentina   2485    60.0
3            Australia   5298    10.0
4              Austria     19     0.0

In [19]:
swine_data_dfSum['ID'] = swine_data_dfSum.index
swine_data_dfSum.head()

               Country  Cases  Deaths  ID
0              Algeria      5     0.0   0
1  Antigua and Barbuda      2     0.0   1
2            Argentina   2485    60.0   2
3            Australia   5298    10.0   3
4              Austria     19     0.0   4

In [24]:
#Confirm tables
engine.table_names()

['corona_virus_table', 'swineFlu', 'corona_virus', 'swine_flu']

In [25]:
swine_data_dfSum.to_sql(name='swine_flu', con=engine, if_exists='replace', index=False)

In [26]:
pd.read_sql_query('select * from swine_flu', con=engine).head()

               Country  Cases  Deaths  ID
0              Algeria      5     0.0   0
1  Antigua and Barbuda      2     0.0   1
2            Argentina   2485    60.0   2
3            Australia   5298    10.0   3
4              Austria     19     0.0   4